Revit 2026 API

# BuiltInFailuresSteelElementFailures Class

---

Failures about steel elements

SystemObject Autodesk.Revit.DBBuiltInFailuresSteelElementFailures

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static class SteelElementFailures
```
```vb
Public NotInheritable Class SteelElementFailures
```
```cpp
public ref class SteelElementFailures abstract sealed
```
```fsharp
[<AbstractClassAttribute>]
[<SealedAttribute>]
type SteelElementFailures = class end
```

The BuiltInFailuresSteelElementFailures type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | SteelElementModifyParametersTaskNotFinished | Cannot modify parameters while background calculations are in progress. |
|  | SteelElementModifyRangesTaskNotFinished | Cannot modify ranges while background calculations are in progress. |
|  | SteelElementPreviewTaskNotFinished | Cannot create preview while background calculations are in progress. |
|  | SteelElementPropagationTaskNotFinished | Advance Steel propagation tasks not finished. |
|  | SteelElementTaskNotFinished | Advance Steel tasks not finished. |

#### Reference

Autodesk.Revit.DB Namespace